bench/results/20260917T195041Z-cursor/raw/heavy/api/node/round1/mix-r2000.wrk2.txt
Running 10s test @ http://127.0.0.1:18401
  1 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49ms    0.99ms  24.90ms   89.61%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.35ms
 75.000%    1.82ms
 90.000%    2.29ms
 99.000%    4.96ms
 99.900%   12.68ms
 99.990%   22.88ms
 99.999%   24.91ms
100.000%   24.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.234     0.000000            1         1.00
       0.672     0.100000         1887         1.11
       0.876     0.200000         3773         1.25
       1.046     0.300000         5672         1.43
       1.195     0.400000         7539         1.67
       1.347     0.500000         9425         2.00
       1.436     0.550000        10371         2.22
       1.521     0.600000        11309         2.50
       1.617     0.650000        12263         2.86
       1.708     0.700000        13193         3.33
       1.817     0.750000        14143         4.00
       1.873     0.775000        14610         4.44
       1.944     0.800000        15084         5.00
       2.012     0.825000        15548         5.71
       2.085     0.850000        16029         6.67
       2.181     0.875000        16497         8.00
       2.233     0.887500        16730         8.89
       2.285     0.900000        16962        10.00
       2.349     0.912500        17197        11.43
       2.423     0.925000        17438        13.33
       2.517     0.937500        17671        16.00
       2.563     0.943750        17791        17.78
       2.621     0.950000        17906        20.00
       2.695     0.956250        18023        22.86
       2.783     0.962500        18140        26.67
       2.919     0.968750        18259        32.00
       2.999     0.971875        18317        35.56
       3.123     0.975000        18375        40.00
       3.289     0.978125        18434        45.71
       3.485     0.981250        18493        53.33
       3.853     0.984375        18552        64.00
       4.019     0.985938        18581        71.11
       4.295     0.987500        18611        80.00
       4.635     0.989062        18641        91.43
       5.099     0.990625        18670       106.67
       5.543     0.992188        18699       128.00
       5.775     0.992969        18714       142.22
       5.995     0.993750        18729       160.00
       6.231     0.994531        18743       182.86
       6.515     0.995313        18758       213.33
       7.047     0.996094        18773       256.00
       7.231     0.996484        18780       284.44
       7.863     0.996875        18788       320.00
       8.103     0.997266        18795       365.71
       8.247     0.997656        18802       426.67
       8.567     0.998047        18811       512.00
       8.719     0.998242        18813       568.89
       9.271     0.998437        18817       640.00
       9.415     0.998633        18821       731.43
      10.095     0.998828        18824       853.33
      13.503     0.999023        18828      1024.00
      14.639     0.999121        18830      1137.78
      16.247     0.999219        18832      1280.00
      16.735     0.999316        18834      1462.86
      17.279     0.999414        18835      1706.67
      19.327     0.999512        18837      2048.00
      19.631     0.999561        18839      2275.56
      19.631     0.999609        18839      2560.00
      20.111     0.999658        18840      2925.71
      20.927     0.999707        18841      3413.33
      22.047     0.999756        18842      4096.00
      22.047     0.999780        18842      4551.11
      22.799     0.999805        18843      5120.00
      22.799     0.999829        18843      5851.43
      22.879     0.999854        18844      6826.67
      22.879     0.999878        18844      8192.00
      22.879     0.999890        18844      9102.22
      23.615     0.999902        18845     10240.00
      23.615     0.999915        18845     11702.86
      23.615     0.999927        18845     13653.33
      23.615     0.999939        18845     16384.00
      23.615     0.999945        18845     18204.44
      24.911     0.999951        18846     20480.00
      24.911     1.000000        18846          inf
#[Mean    =        1.489, StdDeviation   =        0.992]
#[Max     =       24.896, Total count    =        18846]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18847 requests in 10.00s, 11.52MB read
Requests/sec:   1884.85
Transfer/sec:      1.15MB
MIX_ERRORS connect=0 read=0 write=0 status=0 timeout=0