bench/results/20260917T195041Z-cursor/raw/heavy/api/node/round1/warmup.txt
Running 3s test @ http://127.0.0.1:18401
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.00ms   19.83ms 281.69ms   96.71%
    Req/Sec    13.49k     4.21k   17.18k    83.87%
  41618 requests in 3.10s, 24.44MB read
Requests/sec:  13427.81
Transfer/sec:      7.89MB
MIX_ERRORS connect=0 read=0 write=0 status=0 timeout=0